paypal-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/paypal/lookupStoredCreditCard.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.paypal.lookupstoredcreditcard">
  <soapenv:Header/>
   <soapenv:Body>
   <urn:Paypal>
  	<urn:paypalApiUrl>https://api.sandbox.paypal.com</urn:paypalApiUrl>      
   	<urn:id>CARD-0XU77818DK8407512KKSWJOY</urn:id>
   	<urn:authorization>Bearer L8XmqR.Jp3ziVtzRTY0WEUfMpsE5Xw1qor2fGv51r.E</urn:authorization>
   </urn:Paypal>
   </soapenv:Body>
</soapenv:Envelope>
